Revit 2027 API
PipeSettings.SetDownFromBottom Property
 The abbreviation of the Set Down from bottom of fitting (SDB) string.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SetDownFromBottom { get; set; }
Public Property SetDownFromBottom As String
	Get
	Set
public:
property String^ SetDownFromBottom {
	String^ get ();
	void set (String^ value);
}
member SetDownFromBottom : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace